# Пользователь вводит номер буквы в алфавите. Определить, какая это буква.

a = int(input("Введите номер буквы в алфавите "))
print(chr(a+96))